<img src="https://github.com/CorndelDataAnalyticsDiploma/workshop/blob/master/Corndel%20Digital%20Logo%20Centre.png?raw=true" alt="Corndel" width ="301.5" height=216>

# Learning to use Pandas for data analysis by Subeksha 

#### Welcome to the first workshop on Pandas!

Note: Depending on your programming journey, a lot of this may seem new. My advice is:

1. Don't panic.
2. Read the code - then read the documentation. Google anything weird.
3. Comment wherever you can to secure learning or question unknowns.
4. Take. It. Slow. Remember the time frame.
5. Persevere and revisit independently - treat this notebook like a reference and a starting point.

<hr>

<a id='Contents'></a>
## Contents
In this workshop, we will:<b>

- [Import](#import) some data from csv files 
- [Explore](#explore) the data
- [Select](#select) the columns that we're interested in 
- [Filter](#filter) the rows of the DataFrame 
- [Group](#group) and aggregate the data 
- [Merge](#merge) DataFrames together 
- [Export](#export) the filtered data to a CSV or Excel spreadsheet
- [Further Reading](#further)

</b>

<a id="import"></a>
# Import packages and read data
[Back to Contents](#Contents)

First, we will import the packages that we will need later. In this case, there is only one: **pandas**

Pandas manages data tables and column-based data structures, which we will use to do our analysis. We import this package and give it an alias ``pd``

The syntax for importing a package is:
> <span style="color:blue">\# *Import the xxx package*</span><br>
<span style="color:green;font-weight:bold">import</span> xxx <span style="color:green;font-weight:bold">as</span> x 


In this example, *xxx* is the name of the package and *x* is the alias we give it to make it easier to refer to later.

You can find **pandas** documentation [here](https://pandas.pydata.org/)

**Watch out: Python is case sensitive!**

In [1]:
# Import the pandas package
import pandas as pd

In [2]:
## Read the customer table and assign it the label 'customer' so we can refer to it later

customer = pd.read_csv('./data/customer.csv')

---
### Let's break down this line to see what's happening:

### ``'./data/customer.csv'`` is a *string*

In Python text is stored as a **string**, a sequence of characters enclosed in *'single quotes'*, *"double quotes"*, or *"""triple quotes"""*.

Everything in Python is an **object** and every object in Python has a **type**. Computer programs typcally keep track of a range of data types. For example, `1.5` is a floating point number, while `1` is an integer. Programs need to distinguish between these two types for various reasons:

- They are stored in memory differently.
- Their arithmetic operations are different


Some of the basic numerical types in Python include:

- **`int`** (integer; a whole number with no decimal place)
  - `10`
  - `-3`
  
- **`float`** (float; a number that has a decimal place)
  - `7.41`
  - `-0.006`

### ``pd.read_csv`` is a function in the Pandas module

Remember from SQL: ``Server.Database.Schema.Table.Column``

**``.``** are used to denote nested objects

``read_csv`` is a Pandas function, so part of ``pd``

### ``customer =`` assigns our object to the customer variable 

Our customer table is given a label ``customer``. These *variables* are like the aliases we saw in SQL. 

In Python, a variable is a name you specify in your code that maps to a particular *object*, object *instance*, or value.

By defining variables, we can refer to things by names that make sense to us. Names for variables can only contain letters, underscores (`_`), or numbers (no spaces, dashes, or other characters). *Variable names must start with a letter or underscore - good practice is to start with a letter*

We assign a label to an object with a single ``=``

---
<a id="explore"></a>
# Exploring the data
[Back to Contents](#Contents)

Next, we will explore the data by using the *.head()* method to see the top rows and the *columns* attribute to see the names of all the columns.

The syntax for using the *.head()* method to get the top rows is:
> DataFrame.head()

In this example *DataFrame* is the name of the table.

[The ``head`` documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html)

In [3]:
customer

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,True,2006-02-14,2006-02-15 09:57:20,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,True,2006-02-14,2006-02-15 09:57:20,1
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,True,2006-02-14,2006-02-15 09:57:20,1
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,True,2006-02-14,2006-02-15 09:57:20,1
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,True,2006-02-14,2006-02-15 09:57:20,1
...,...,...,...,...,...,...,...,...,...,...
594,595,1,TERRENCE,GUNDERSON,TERRENCE.GUNDERSON@sakilacustomer.org,601,True,2006-02-14,2006-02-15 09:57:20,1
595,596,1,ENRIQUE,FORSYTHE,ENRIQUE.FORSYTHE@sakilacustomer.org,602,True,2006-02-14,2006-02-15 09:57:20,1
596,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,True,2006-02-14,2006-02-15 09:57:20,1
597,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,True,2006-02-14,2006-02-15 09:57:20,1
598,599,2,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,605,True,2006-02-14,2006-02-15 09:57:20,1

In [4]:
## Explore the top 5 rows of data using the .head() method
customer.head()

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,True,2006-02-14,2006-02-15 09:57:20,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,True,2006-02-14,2006-02-15 09:57:20,1
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,True,2006-02-14,2006-02-15 09:57:20,1
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,True,2006-02-14,2006-02-15 09:57:20,1
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,True,2006-02-14,2006-02-15 09:57:20,1

<div class="alert alert-block alert-warning">
<b>Note</b>
This is the same as a SQL SELECT clause<br>
    
> <span style="color:purple;font-weight:bold">SELECT</span> * <br>
  <span style="color:purple;font-weight:bold">FROM</span> customer <br>
  <span style="color:purple;font-weight:bold">LIMIT</span> 5
    </div>

We can also look at the end of a DataFrame, known as the ``tail`` [(Here is the documentation)](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html?highlight=tail#pandas.DataFrame.tail)

In [5]:
customer.tail(10)

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
589,590,2,SETH,HANNON,SETH.HANNON@sakilacustomer.org,596,True,2006-02-14,2006-02-15 09:57:20,1
590,591,1,KENT,ARSENAULT,KENT.ARSENAULT@sakilacustomer.org,597,True,2006-02-14,2006-02-15 09:57:20,1
591,592,1,TERRANCE,ROUSH,TERRANCE.ROUSH@sakilacustomer.org,598,True,2006-02-14,2006-02-15 09:57:20,0
592,593,2,RENE,MCALISTER,RENE.MCALISTER@sakilacustomer.org,599,True,2006-02-14,2006-02-15 09:57:20,1
593,594,1,EDUARDO,HIATT,EDUARDO.HIATT@sakilacustomer.org,600,True,2006-02-14,2006-02-15 09:57:20,1
594,595,1,TERRENCE,GUNDERSON,TERRENCE.GUNDERSON@sakilacustomer.org,601,True,2006-02-14,2006-02-15 09:57:20,1
595,596,1,ENRIQUE,FORSYTHE,ENRIQUE.FORSYTHE@sakilacustomer.org,602,True,2006-02-14,2006-02-15 09:57:20,1
596,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,True,2006-02-14,2006-02-15 09:57:20,1
597,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,True,2006-02-14,2006-02-15 09:57:20,1
598,599,2,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,605,True,2006-02-14,2006-02-15 09:57:20,1

In [6]:
customer.columns

Index(['customer_id', 'store_id', 'first_name', 'last_name', 'email',
       'address_id', 'activebool', 'create_date', 'last_update', 'active'],
      dtype='object')

In [7]:
customer.dtypes

customer_id     int64
store_id        int64
first_name     object
last_name      object
email          object
address_id      int64
activebool       bool
create_date    object
last_update    object
active          int64
dtype: object

### Why does ``head`` have brackets after it but not ``columns``?

``head`` is a *method*: a function bound to an object

``columns`` is an *attribute*: a property of an object that you can access

<div class="alert alert-block alert-success">
    Think of a <b><i>car</i></b> as an object. 
    
- It has *attributes*, such as the colour and the level of fuel.
- It has *methods*, such as turning on the engine or adding fuel to the tank
- You can also apply *functions* to it, such as washing the car or painting it
</div>

<div class="alert alert-block alert-info">
<b>Task:</b> <ul>
    <li> Import the payment table, fount at <i>data/payment.csv</i> 
    <li> Use the <i>.head()</i> method to explore it
    <li> Explore the data types using the <i>.dtypes</i> attribute
</ul></div>

In [8]:
# ** Task 1 ** #
# Use the space below to read in the data from ./data/payment.csv into the variable label payment
# and use the .head() method to explore it.

# --------------------------------------------------- #



# --------------------------------------------------- #

<details>
    <summary style="color:green;font-weight:bold">Click here for the answer to task 1</summary>
    
> <span style="color:blue">\# *Read the inequality data* </span><br>
    payment = pd.read_csv(<span style="color:red">'./data/payment.csv'</span>)<br><br>
    payment.head()
</details>

In [9]:
# ** Task 2 ** #
# Use the space below explore the data types of the payment table using the .dtypes attribute

# --------------------------------------------------- #



# --------------------------------------------------- #

<details>
    <summary style="color:green;font-weight:bold">Click here for the answer to task 2</summary>
    
> <span style="color:blue">\# *Find out the data types* </span><br>
    payment.dtypes
</details>

We can get some basic descriptive statistics using the ``describe`` method

[Here is the .decribe documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html?highlight=describe#pandas.DataFrame.describe)

In [10]:
customer.describe()

       customer_id    store_id  address_id      active
count   599.000000  599.000000  599.000000  599.000000
mean    300.000000    1.455760  304.724541    0.974958
std     173.060683    0.498455  173.698609    0.156382
min       1.000000    1.000000    5.000000    0.000000
25%     150.500000    1.000000  154.500000    1.000000
50%     300.000000    1.000000  305.000000    1.000000
75%     449.500000    2.000000  454.500000    1.000000
max     599.000000    2.000000  605.000000    1.000000

<div class="alert alert-block alert-warning">
<b>Question:</b> Why are only these columns described?
</div>

---
<a id="select"></a>
# Selecting Columns
[Back to Contents](#Contents)

If we only want some parts of a DataFrame, we need to be able to specify the columns we are interested in. 
To do so, we need to be able to choose (a) specific column(s) from our DataFrame. 

Note: A column returned on its own is returned as a *Series*

The syntax for choosing a Column from the DataFrame and returning it as a *Series* is:
> DataFrame\[<span style='color:blue'>'Column'</span>\]

The syntax for choosing more than one column from the DataFrame, returning a *DataFrame* is:
> DataFrame\[\[<span style='color:blue'>'Column 1'</span>, <span style='color:blue'>'Column 2'</span>\]\]

The syntax for choosing a Column from the DataFrame and returning a *DataFrame* is:
> DataFrame\[\[<span style='color:blue'>'Column'</span>\]\]

In these examples, *DataFrame* is the name of the DataFrame and *Column* is the name of the Column.

In [11]:
customer['first_name']

0           MARY
1       PATRICIA
2          LINDA
3        BARBARA
4      ELIZABETH
         ...
594     TERRENCE
595      ENRIQUE
596      FREDDIE
597         WADE
598       AUSTIN
Name: first_name, Length: 599, dtype: object

In [12]:
customer[['first_name', 'last_name']]

    first_name  last_name
0         MARY      SMITH
1     PATRICIA    JOHNSON
2        LINDA   WILLIAMS
3      BARBARA      JONES
4    ELIZABETH      BROWN
..         ...        ...
594   TERRENCE  GUNDERSON
595    ENRIQUE   FORSYTHE
596    FREDDIE     DUGGAN
597       WADE   DELVALLE
598     AUSTIN    CINTRON

[599 rows x 2 columns]

<div class="alert alert-block alert-warning">
<b>Note</b>
This is the same as a SQL SELECT clause<br>
    
> <span style="color:purple;font-weight:bold">SELECT</span> first_name, last_name<br>
<span style="color:purple;font-weight:bold">FROM</span> customer
    </div>

In [13]:
customer[['first_name', 'last_name']].describe()

       first_name last_name
count         599       599
unique        591       599
top        WILLIE    RUNYON
freq            2         1

In [14]:
customer['store_id'].unique()

array([1, 2], dtype=int64)

<div class="alert alert-block alert-warning">
<b>Note</b>
This is the same as a SQL DISTINCT function<br>
    
> <span style="color:purple;font-weight:bold">SELECT  DISTINCT</span>(store_id)<br>
<span style="color:purple;font-weight:bold">FROM</span> customer
    </div>

## Plotting

Pandas allows us to plot data from the DataFrame. Pandas will plot for you most of the [standard plots you would want](https://pandas.pydata.org/pandas-docs/stable/user_guide/visualization.html#visualization)

Lets find out how frequent different amounts are paid.

In [16]:
payment.hist(column='amount');

#### Keyword parameters
We can tidy up this plot by [using some more parameters](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.hist.html?highlight=hist#pandas.DataFrame.hist). These parameters are given with a *keyword*, like a preset label, that is assigned a value. 

> ``(keyword=value, next_keyword=next_value)``

Previously, all the functions you have seen in Python and SQL have had ***positional*** arguments, such as ``head``, ``CAST`` or ``ROUND``. Positional arguments need to be given in a specific order. As they are labelled, keyword arguments can be put in any order.

We can see that the maximum amount spent is £12, so lets use 12 bins for the histogram rather than the default of 10.

In [17]:
payment.hist(column='amount', grid=False, bins=12);

---
### Sort Values

Next, we will sort the customers by their first name.

The syntax for sorting the data is:
> <span style="color:blue">\# *Sort the data from lowest to highest*</span><br>
DataFrame.sort_values(by = <span style='color:red'>'Column'</span>)

In this example *DataFrame* is the name of the DataFrame, *Column* is the name of the Column we want to sort by.

[The sort_values documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html)

In [18]:
customer.sort_values(by='first_name').head()

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
374,375,2,AARON,SELBY,AARON.SELBY@sakilacustomer.org,380,True,2006-02-14,2006-02-15 09:57:20,1
366,367,1,ADAM,GOOCH,ADAM.GOOCH@sakilacustomer.org,372,True,2006-02-14,2006-02-15 09:57:20,1
524,525,2,ADRIAN,CLARY,ADRIAN.CLARY@sakilacustomer.org,531,True,2006-02-14,2006-02-15 09:57:20,1
216,217,2,AGNES,BISHOP,AGNES.BISHOP@sakilacustomer.org,221,True,2006-02-14,2006-02-15 09:57:20,1
388,389,1,ALAN,KAHN,ALAN.KAHN@sakilacustomer.org,394,True,2006-02-14,2006-02-15 09:57:20,1

<div class="alert alert-block alert-warning">
<b>Note</b>
This is the same as a SQL ORDER BY clause<br>
    
> <span style="color:purple;font-weight:bold">SELECT</span> * <br>
  <span style="color:purple;font-weight:bold">FROM</span> customer <br>
  <span style="color:purple;font-weight:bold">ORDER BY</span> first_name
</div>

We can sort by multiple columns:

In [19]:
customer.sort_values(by=['store_id', 'address_id'], ascending=False).head()

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
598,599,2,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,605,True,2006-02-14,2006-02-15 09:57:20,1
592,593,2,RENE,MCALISTER,RENE.MCALISTER@sakilacustomer.org,599,True,2006-02-14,2006-02-15 09:57:20,1
589,590,2,SETH,HANNON,SETH.HANNON@sakilacustomer.org,596,True,2006-02-14,2006-02-15 09:57:20,1
583,584,2,SALVADOR,TEEL,SALVADOR.TEEL@sakilacustomer.org,590,True,2006-02-14,2006-02-15 09:57:20,1
581,582,2,ANDY,VANHORN,ANDY.VANHORN@sakilacustomer.org,588,True,2006-02-14,2006-02-15 09:57:20,1

Notice that this sorts the values *temporarily*. To fix it, use the *inplace flag*.

The syntax for sorting the data in place is:
> <span style="color:blue">\# *Sort the data in place from the beginning to end of the alphabet* </span><br>
DataFrame.sort_values(by = <span style='color:red'>'Column'</span>, inplace = <span style='color:green; font-weight:bold'>True</span>)

In [20]:
customer.sort_values(by='first_name', inplace=True)
customer.head()

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
374,375,2,AARON,SELBY,AARON.SELBY@sakilacustomer.org,380,True,2006-02-14,2006-02-15 09:57:20,1
366,367,1,ADAM,GOOCH,ADAM.GOOCH@sakilacustomer.org,372,True,2006-02-14,2006-02-15 09:57:20,1
524,525,2,ADRIAN,CLARY,ADRIAN.CLARY@sakilacustomer.org,531,True,2006-02-14,2006-02-15 09:57:20,1
216,217,2,AGNES,BISHOP,AGNES.BISHOP@sakilacustomer.org,221,True,2006-02-14,2006-02-15 09:57:20,1
388,389,1,ALAN,KAHN,ALAN.KAHN@sakilacustomer.org,394,True,2006-02-14,2006-02-15 09:57:20,1

---
### Reset Index

You may notice that the index of the customer data is no longer in order. We can get it back in order by [resetting the index](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html?highlight=reset#pandas.DataFrame.reset_index). 

Note:When we looked at the columns in the table, the index is not listed!

The syntax for resetting the index is:
> <span style="color:blue">\# *Reset the index* </span><br>
DataFrame.reset_index()

In this example *DataFrame* is the name of the DataFrame.

If we wanted to set the index, we could use the ``set_index`` method, whose documentation is [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.set_index.html)

In [21]:
## Reset the index
customer.reset_index().head()

,index,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,374,375,2,AARON,SELBY,AARON.SELBY@sakilacustomer.org,380,True,2006-02-14,2006-02-15 09:57:20,1
1,366,367,1,ADAM,GOOCH,ADAM.GOOCH@sakilacustomer.org,372,True,2006-02-14,2006-02-15 09:57:20,1
2,524,525,2,ADRIAN,CLARY,ADRIAN.CLARY@sakilacustomer.org,531,True,2006-02-14,2006-02-15 09:57:20,1
3,216,217,2,AGNES,BISHOP,AGNES.BISHOP@sakilacustomer.org,221,True,2006-02-14,2006-02-15 09:57:20,1
4,388,389,1,ALAN,KAHN,ALAN.KAHN@sakilacustomer.org,394,True,2006-02-14,2006-02-15 09:57:20,1

Notice that a new column has been added: ``index``, the old index! To stop this, we can use the *``drop`` flag* and set it to ``True``

Also, this resets the index *temporarily*. To fix it, use the *``inplace`` flag* and set it to ``True``.

The syntax for sorting the data in place is:
> DataFrame.reset_index(inplace = <span style='color:green; font-weight:bold'>True</span>, drop = <span style='color:green; font-weight:bold'>True</span>)

In [22]:
## Reset the index in place
customer.reset_index(inplace = True, drop = True)
customer.head()

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,375,2,AARON,SELBY,AARON.SELBY@sakilacustomer.org,380,True,2006-02-14,2006-02-15 09:57:20,1
1,367,1,ADAM,GOOCH,ADAM.GOOCH@sakilacustomer.org,372,True,2006-02-14,2006-02-15 09:57:20,1
2,525,2,ADRIAN,CLARY,ADRIAN.CLARY@sakilacustomer.org,531,True,2006-02-14,2006-02-15 09:57:20,1
3,217,2,AGNES,BISHOP,AGNES.BISHOP@sakilacustomer.org,221,True,2006-02-14,2006-02-15 09:57:20,1
4,389,1,ALAN,KAHN,ALAN.KAHN@sakilacustomer.org,394,True,2006-02-14,2006-02-15 09:57:20,1

---
<a id="filter"></a>
# Filtering Rows
[Back to Contents](#Contents)

If we wish to look at subsets of the data, we will need to filter or group it. Lets start by learning to filter it.

To do so, we need to be able to choose a specific row from our table.

The syntax for filtering a DataFrame is:
> <span style="color:blue">\# *Filter the DataFrame* </span><br>
DataFrame\[ DataFrame\[<span style='color:red'>'Column'</span>\] == <span style='color:red'>'value'</span> \]

In this example *DataFrame* is the name of the DataFrame, *Column* is the name of the column we want to filter on and *value* is the value we're interested in.

In [23]:
# Filter the table to just the store that we are interested in

customer[customer['store_id'] == 2]

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,375,2,AARON,SELBY,AARON.SELBY@sakilacustomer.org,380,True,2006-02-14,2006-02-15 09:57:20,1
2,525,2,ADRIAN,CLARY,ADRIAN.CLARY@sakilacustomer.org,531,True,2006-02-14,2006-02-15 09:57:20,1
3,217,2,AGNES,BISHOP,AGNES.BISHOP@sakilacustomer.org,221,True,2006-02-14,2006-02-15 09:57:20,1
6,568,2,ALBERTO,HENNING,ALBERTO.HENNING@sakilacustomer.org,574,True,2006-02-14,2006-02-15 09:57:20,1
7,454,2,ALEX,GRESHAM,ALEX.GRESHAM@sakilacustomer.org,459,True,2006-02-14,2006-02-15 09:57:20,1
...,...,...,...,...,...,...,...,...,...,...
593,359,2,WILLIE,MARKHAM,WILLIE.MARKHAM@sakilacustomer.org,364,True,2006-02-14,2006-02-15 09:57:20,1
594,219,2,WILLIE,HOWELL,WILLIE.HOWELL@sakilacustomer.org,223,True,2006-02-14,2006-02-15 09:57:20,1
595,212,2,WILMA,RICHARDS,WILMA.RICHARDS@sakilacustomer.org,216,True,2006-02-14,2006-02-15 09:57:20,1
596,190,2,YOLANDA,WEAVER,YOLANDA.WEAVER@sakilacustomer.org,194,True,2006-02-14,2006-02-15 09:57:20,1
597,174,2,YVONNE,WATKINS,YVONNE.WATKINS@sakilacustomer.org,178,True,2006-02-14,2006-02-15 09:57:20,1

---
#### Let's break down this line to see what's happening:

In [24]:
# Let's see what happens when we run the following code:

store_id_filter = customer['store_id'] == 2
store_id_filter

0       True
1      False
2       True
3       True
4      False
       ...
594     True
595     True
596     True
597     True
598    False
Name: store_id, Length: 599, dtype: bool

#### These can be combined together

In [25]:
# That code creates a Series of True/False that we can use to filter data.

# If we put a series of True/False into square brackets, then
# the data will be filtered to only those rows where the value is 'True'

customer[store_id_filter]

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,375,2,AARON,SELBY,AARON.SELBY@sakilacustomer.org,380,True,2006-02-14,2006-02-15 09:57:20,1
2,525,2,ADRIAN,CLARY,ADRIAN.CLARY@sakilacustomer.org,531,True,2006-02-14,2006-02-15 09:57:20,1
3,217,2,AGNES,BISHOP,AGNES.BISHOP@sakilacustomer.org,221,True,2006-02-14,2006-02-15 09:57:20,1
6,568,2,ALBERTO,HENNING,ALBERTO.HENNING@sakilacustomer.org,574,True,2006-02-14,2006-02-15 09:57:20,1
7,454,2,ALEX,GRESHAM,ALEX.GRESHAM@sakilacustomer.org,459,True,2006-02-14,2006-02-15 09:57:20,1
...,...,...,...,...,...,...,...,...,...,...
593,359,2,WILLIE,MARKHAM,WILLIE.MARKHAM@sakilacustomer.org,364,True,2006-02-14,2006-02-15 09:57:20,1
594,219,2,WILLIE,HOWELL,WILLIE.HOWELL@sakilacustomer.org,223,True,2006-02-14,2006-02-15 09:57:20,1
595,212,2,WILMA,RICHARDS,WILMA.RICHARDS@sakilacustomer.org,216,True,2006-02-14,2006-02-15 09:57:20,1
596,190,2,YOLANDA,WEAVER,YOLANDA.WEAVER@sakilacustomer.org,194,True,2006-02-14,2006-02-15 09:57:20,1
597,174,2,YVONNE,WATKINS,YVONNE.WATKINS@sakilacustomer.org,178,True,2006-02-14,2006-02-15 09:57:20,1

<div class="alert alert-block alert-warning">
<b>Note</b>
This is the same as a SQL WHERE clause<br>
    
> <span style="color:purple;font-weight:bold">SELECT</span> *<br>
<span style="color:purple;font-weight:bold">FROM</span> customer<br>
<span style="color:purple;font-weight:bold">WHERE</span> store_id = 2
    </div>

In [26]:
first_name_filter = customer['first_name'].str.upper() == 'WILLIE'
first_name_filter

0      False
1      False
2      False
3      False
4      False
       ...
594     True
595    False
596    False
597    False
598    False
Name: first_name, Length: 599, dtype: bool

In [27]:
customer[(store_id_filter) & (first_name_filter)]

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
593,359,2,WILLIE,MARKHAM,WILLIE.MARKHAM@sakilacustomer.org,364,True,2006-02-14,2006-02-15 09:57:20,1
594,219,2,WILLIE,HOWELL,WILLIE.HOWELL@sakilacustomer.org,223,True,2006-02-14,2006-02-15 09:57:20,1

<div class="alert alert-block alert-warning">
<b>Note</b>
This is the same as a SQL WHERE clause<br>
    
> <span style="color:purple;font-weight:bold">SELECT</span> *<br>
<span style="color:purple;font-weight:bold">FROM</span> customer<br>
<span style="color:purple;font-weight:bold">WHERE</span> store_id = 2 
    <span style="color:purple;font-weight:bold">and UPPER</span>(first_name) = 'WILLIE'
    </div>

#### Filtering on the index

When we bring in a DataFrame, it is automatically assigned an **index** (the *0,1,2,3,...* column). Indexes are useful because they are a **primary key**, just like in SQL.

Assigning appropriate indexes allows us to work with our data more efficiently. For example, we can use the `.loc[]` attribute to filter on an index.

The syntax for filtering on an index is:
> DataFrame.loc[index_value]

In [28]:
customer.loc[[593,594]]

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
593,359,2,WILLIE,MARKHAM,WILLIE.MARKHAM@sakilacustomer.org,364,True,2006-02-14,2006-02-15 09:57:20,1
594,219,2,WILLIE,HOWELL,WILLIE.HOWELL@sakilacustomer.org,223,True,2006-02-14,2006-02-15 09:57:20,1

You can read more about indexing [here](https://www.askpython.com/python-modules/pandas/dataframe-indexing).

---
<a id="group"></a>
# Aggregating data
[Back to Contents](#Contents)

If we want to look at a customer's aggregate transactions, we can use the *.groupby()* method to aggregate the data.

The syntax for aggregating the DataFrame is:
> <span style="color:blue">\# *Aggregate the DataFrame by group* </span><br>
DataFrame.groupby(<span style="color:red">'group'</span>)

We can choose what kind of aggregate output we want for the columns by appending the appropreate method. E.g. [sum()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.sum.html#pandas.Series.sum)
> <span style="color:blue">\# *Aggregate the DataFrame by group* </span><br>
DataFrame.groupby(<span style="color:red">'group'</span>).sum()<br>

If we want to apply different aggregation methods to each column, we can with a different syntax
> <span style="color:blue">\# *Aggregate the DataFrame by group* </span><br>
DataFrame.groupby(<span style="color:red">'group'</span>).agg({<br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; <span style="color:red">'Column1'</span> : <span style="color:red">'sum'</span>, <span style="color:blue">\# *take the sum of Column1*</span> <br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; <span style="color:red">'Column2'</span> : <span style="color:red">'mean'</span>, <span style="color:blue">\# *take the mean of Column2*</span> <br>
&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; <span style="color:red">'Column3'</span> : <span style="color:red">'max' </span><span style="color:blue">\# *take the max of Column3*</span> <br>
})

In this example, *group* is the name of the Column we want to group by and *sum/mean/max* are the aggregation methods.

[Here is the groupby documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html)

In [29]:
payment.groupby('customer_id').sum().head()

The sums of payment_id, staff_id and rental_id do not make sense, so we should omit those. We can do so by filtering

In [30]:
payment[['customer_id', 'amount']].groupby('customer_id').sum()

<div class="alert alert-block alert-warning">
<b>Note</b>
This is the same as a SQL GROUP BY clause<br>
    
> <span style="color:purple;font-weight:bold">SELECT</span> customer_id, <span style="color:purple;font-weight:bold">SUM</span>(amount)<br>
<span style="color:purple;font-weight:bold">FROM</span> customer<br>
<span style="color:purple;font-weight:bold">GROUP BY</span> customer_id
    </div>

We can find the customers who have spent the most by ordering them:

In [31]:
payment[['customer_id', 'amount']].groupby('customer_id').sum().sort_values(by='amount', ascending=False)

---
<div class="alert alert-block alert-info">
<b>Task:</b> <ul>
<li> Find the staff member who has the highest average sale
</ul></div>

In [32]:
# ** Task 3 ** #
# Find the staff member who has the highest average sale

# --------------------------------------------------- #



# --------------------------------------------------- #

<details>
    <summary style="color:green;font-weight:bold">Click here for the answer to task 3</summary>
    
> payment[[<span style="color:red">'staff_id'</span>, <span style="color:red">'amount'</span>]].<span style="color:green">groupby</span>(<span style="color:red">'staff_id'</span>).<span style="color:green">mean</span>().<span style="color:green">sort_values</span>(by=<span style="color:red">'amount'</span>, ascending=False)
    

</details>

In [33]:
payment.describe()

---
<a id="merge"></a>
# Merging data
[Back to Contents](#Contents)

So far, we have only looked at one table at a time. If we want information from multiple tables we will need to join them together.

The syntax for merging two DataFrames is:
> <span style="color:blue">\# *Merge the left and right DataFrames* </span><br>
pd.merge(<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;left, <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;right,<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;how = <span style="color:red">'inner'</span>,<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;left_on = <span style="color:red">'left_join_field'</span>,<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;right_on = <span style="color:red">'right_join_field'</span><br>
)

In this example, *left* is the name of the first DataFrames in the join (just like in a SQL join), *right* is the name of the second DataFrames in the join and *how* is the way we join them (can be 'left' or 'inner'). The *left_join_field* and *right_join_field* are the Series to merge on.

[The merge documentation can be found here](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html#database-style-dataframe-or-named-series-joining-merging)

In [ ]:
## Merge the DataFrames using the .merge() method

pd.merge(left = customer,
         right = payment,
         how = 'left',
         left_on = 'customer_id',
         right_on = 'customer_id'
        ).head()

<div class="alert alert-block alert-warning">
<b>Note</b>
This is the same as a SQL JOIN clause<br>
    
> <span style="color:purple;font-weight:bold">SELECT</span> *<br>
<span style="color:purple;font-weight:bold">FROM</span> customer<br>
<span style="color:purple;font-weight:bold">LEFT JOIN</span> payment 
    <span style="color:purple;font-weight:bold">ON</span> customer.customer_id = payment.customer_id
    </div>

## Lets look at our original question: Which EU countries have the most profitable customers?

Lets find the total spent by the customers over the first 5 months of 2017

In [ ]:
customer_payments = payment[['customer_id', 'amount']].groupby('customer_id').sum()
customer_payments.head()

lets rename that column to ``total_amount``

In [ ]:
customer_payments.rename(columns={'amount': 'total_amount'}, inplace=True)
customer_payments.columns

We will need some other tables to allow us to find out which country each customer is in

In [ ]:
address = pd.read_csv('./data/address.csv')
city = pd.read_csv('./data/city.csv')
country = pd.read_csv('./data/country.csv')

We are going to do many merges, so lets use a slightly different syntax, the *method* ``merge`` rather than the function

We can find its documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html?highlight=merge#pandas.DataFrame.merge)

In [ ]:
customer_payment_full_details = customer.merge(right = customer_payments,
                                               how = 'left',
                                               left_on = 'customer_id',
                                               right_on = 'customer_id'
                                              ).merge(right = address,
                                                      how = 'left',
                                                      left_on = 'address_id',
                                                      right_on = 'address_id'
                                                     ).merge(right = city,
                                                             how = 'left',
                                                             left_on = 'city_id',
                                                             right_on = 'city_id'
                                                            ).merge(right = country,
                                                              how = 'left',
                                                              left_on = 'country_id',
                                                              right_on = 'country_id')

customer_payment_full_details.head(5)

We don't want most of these columns, so lets only keep the ones we need. To do that, it helps to know which ones there are:

In [ ]:
customer_payment_full_details.columns

In [ ]:
customer_payment_details = customer_payment_full_details[['customer_id', 'address_id', 'activebool', 'total_amount', 
                                                          'city_id', 'city', 'country_id', 'country']]
customer_payment_details.head()

In [ ]:
useful_columns = ['customer_id', 'total_amount', 'country_id', 'country']

customer_payment_details_grouped = customer_payment_details[useful_columns].groupby('country_id')

avg_country_customer = customer_payment_details_grouped.agg({'total_amount':'mean', 'country':'max'})

avg_country_customer.sort_values('total_amount', ascending=False).head()

In [ ]:
avg_country_customer.plot.barh(x='country', y='total_amount');

Lets tidy this up a bit:

In [ ]:
avg_country_customer.sort_values('total_amount', inplace=True)

In [ ]:
avg_country_customer.head()

In [ ]:
#avg_country_customer.country.unique()
eu_countries = ['Austria', 'Belgium', 'Bulgaria', 'Croatia', 'Czech Republic', 'Denmark', 'Estonia', 'Finland', 'France', 
                'Germany', 'Greece', 'Hungary', 'Ireland', 'Italy', 'Latvia', 'Lithuania', 'Luxembourg', 'Malta', 'Netherlands', 
                'Poland', 'Portugal', 'Romania', 'Slovakia', 'Slovenia', 'Spain', 'Sweden']

In [ ]:
avg_eu_country_customer = avg_country_customer[avg_country_customer['country'].isin(eu_countries)]

In [ ]:
avg_eu_country_customer.plot.barh(x='country', y='total_amount', figsize=(6, 6));

---
<a id="export"></a>
# Export data to a CSV or Excel

### CSV

Now that we have the data in the shape that we want, we can use *to_csv* to write the data to a csv file.

The syntax for exporting data to a CSV is:
>DataFrame.to_csv(<span style='color:red'>'folder/file.csv'</span>)

In this example *DataFrame* is the name of the DataFrame that we export to a file called *file.csv* in a folder called *folder*. We make use of the *.to_csv()* method. 

[You can find the details for to_csv here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
customer_payment_details.to_csv('data/customer_payment_details.csv')

### Excel spreadsheet

We can also use ``to_excel`` to write the data to an excel file.

[Here is the documentation for to_excel](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_excel.html#pandas.DataFrame.to_excel)

In [ ]:
customer_payment_details.to_excel('data/customer.xlsx', sheet_name='payment_details')

---
<a id="further"></a>
# Further reading
[Back to Contents](#Contents)

### Tutorials
- [Automate the Boring Stuff with Python](https://automatetheboringstuff.com/) is an online (and paper!) book with basic Python tutorials and inspiration on what to do with Python.
- [Towards Data Science](https://towardsdatascience.com/) has articles about data science and data science tools, many of which rely on Python.
- [stack**overflow**](https://stackoverflow.com/questions/tagged/python) is a question and answer site for programming questions.
- [scipy lectures](http://scipy-lectures.org/) are a tutorial for using Python in Scientific computing, including data analysis

### Pandas information
- [Pandas cheatsheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Pandas comparison with SQL](https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html)
- On Aptem, in the ***Python Videos*** component of the Learning plan overview, there is the ***Corndel Pandas Methods.zip***

### Useful packages
#### Plotting
- [MatPlotLib](https://matplotlib.org/) is the basis for the Pandas plotting and can get quite complicated. It has its own [cheatsheet](https://github.com/matplotlib/cheatsheets#cheatsheets), which can be useful for enhancing Pandas plots.
- [Seaborn](https://seaborn.pydata.org/) makes pretty plots with simple syntax, but is focused on specific statistical plots, not general purpose plotting. It is also based on MatPlotLib.

#### Data analysis
- [numpy](https://numpy.org/) is a numerical data manipulation package. Pandas relies heavily on numpy.